Обработки/Reports/_РасшифровкаПоРСБУ_НаличиеИДвижениеФинансовыхВложений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_РасшифровкаПоРСБУ_НаличиеИДвижениеФинансовыхВложений</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючТекущегоВарианта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорядкиОкругленияОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочностьЕдиницыИзмерения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьПереводыДолгосрочных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадолженностьПоМетодикеФОГФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_РасшифровкаПоРСБУ_НаличиеИДвижениеФинансовыхВложений/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Отчет.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	
	Параметры.Свойство("НастройкиОтчета", ЭтаФорма.НастройкиОтчета);
	
	Если Не ЗначениеЗаполнено(Отчет.ЕдиницаИзмерения) Тогда
		Отчет.ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1;
		ЕдиницаИзмеренияПриИзмененииНаСервере();
		Отчет.УчитыватьПереводыДолгосрочных = Истина;
		ЭтаФорма.Заголовок = "Пояснения к балансу. Наличие и движение финансовых вложений, ДЗ, КЗ.";
	КонецЕсли;	
			
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
	Если Не ЗначениеЗаполнено(Отчет.КлючТекущегоВарианта) Тогда
		Отчет.КлючТекущегоВарианта = "Основной";
	КонецЕсли;
	
	ТекНастройки = Неопределено;
	Параметры.Свойство("НастройкиОтчета", ТекНастройки);
	Если ТекНастройки = Неопределено Тогда 
		Отчет.КлючТекущегоВарианта = "Основной";
	КонецЕсли;	
	
	СписокВариантов = ПолучитьСписокВариантов(); 
	
	ЭтаФорма.Заголовок = "Пояснения к балансу. Наличие и движение финансовых вложений, ДЗ, КЗ.";
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.Результат.ИспользуемоеИмяФайла = "Пояснения к балансу. Наличие и движение финансовых вложений, ДЗ, КЗ за " + ПредставлениеПериода(Отчет.Период.ДатаНачала, КонецДня(Отчет.Период.ДатаОкончания)) + ".xlsx";
	Структура = Новый Структура("Организация, КонтактноеЛицо", Отчет.Организация, Подписант);
	Подписант = РаботаСОтчетами.ПолучитьКонтактноеЛицо(Структура);
	
	СтруктураДанныхКонтактногоЛица = Неопределено;
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);
	                             	
	Если СтруктураДанныхКонтактногоЛица = Неопределено Тогда 
		Подписант = Неопределено;		
	ИначеЕсли СтруктураДанныхКонтактногоЛица.Объект <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Отчет.Организация, "ЮрФизЛицо") ИЛИ СтруктураДанныхКонтактногоЛица.КонтактноеЛицо <> Подписант Тогда
		// Если сохранен подписант другой организации, очистим подписанта
		Подписант = Неопределено;
	КонецЕсли;
	
	СтруктураДанныхРуководитель = Неопределено;
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхРуководитель", СтруктураДанныхРуководитель);
	Если СтруктураДанныхРуководитель = Неопределено Тогда 
		ПодписантРуководитель = Неопределено;		
	ИначеЕсли СтруктураДанныхРуководитель.Объект <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Отчет.Организация, "ЮрФизЛицо") ИЛИ СтруктураДанныхРуководитель.КонтактноеЛицо <> ПодписантРуководитель Тогда
		// Если сохранен подписант другой организации, очистим подписанта
		ПодписантРуководитель = Неопределено;
	КонецЕсли;
	
	СтруктураДанныхГлавбух = Неопределено;
	Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхГлавбух", СтруктураДанныхГлавбух);
	Если СтруктураДанныхГлавбух = Неопределено Тогда 
		ПодписантГлавбух = Неопределено;		
	ИначеЕсли СтруктураДанныхГлавбух.Объект <> ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Отчет.Организация, "ЮрФизЛицо") ИЛИ СтруктураДанныхГлавбух.КонтактноеЛицо <> ПодписантГлавбух Тогда
		// Если сохранен подписант другой организации, очистим подписанта
		ПодписантГлавбух = Неопределено;
	КонецЕсли;
	
	ЗадолженностьПоМетодикеФОГФПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетДоверительногоУправленияПриИзменении(Элемент)
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Расшифровка, "НеАктуальность");
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Элемент.Имя = "Подписант" Тогда 
		Параметрыформы = РаботаСОтчетами.ПолучитьПараметрыФормыВыбораКонтактногоЛица(Новый Структура("Организация, КонтактноеЛицо", Отчет.Организация, Подписант));		
	ИначеЕсли Элемент.Имя = "ПодписантРуководитель" Тогда 
		Параметрыформы = РаботаСОтчетами.ПолучитьПараметрыФормыВыбораКонтактногоЛица(Новый Структура("Организация, КонтактноеЛицо", Отчет.Организация, ПодписантРуководитель));		
	ИначеЕсли Элемент.Имя = "ПодписантГлавбух" Тогда
		Параметрыформы = РаботаСОтчетами.ПолучитьПараметрыФормыВыбораКонтактногоЛица(Новый Структура("Организация, КонтактноеЛицо", Отчет.Организация, ПодписантГлавбух));	
	КонецЕсли;	
	
	ОткрытьФормуМодально("РегистрСведений.КонтактныеЛица.ФормаСписка", ПараметрыФормы, Элемент, ЭтаФорма);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(ВыбранноеЗначение);	
	ВыбранноеЗначение = СтруктураДанныхКонтактногоЛица.КонтактноеЛицо;	
	
	Если Элемент.Имя = "Подписант" Тогда 
		Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);	
	ИначеЕсли Элемент.Имя = "ПодписантРуководитель" Тогда 
		Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхРуководитель", СтруктураДанныхКонтактногоЛица);	
	ИначеЕсли Элемент.Имя = "ПодписантГлавбух" Тогда
		Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхГлавбух", СтруктураДанныхКонтактногоЛица);	
	КонецЕсли;	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодписантОчистка(Элемент, СтандартнаяОбработка)
	
	Если Элемент.Имя = "Подписант" Тогда 
		Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", Неопределено);
	ИначеЕсли Элемент.Имя = "ПодписантРуководитель" Тогда 
		Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхРуководитель", Неопределено);		
	ИначеЕсли Элемент.Имя = "ПодписантГлавбух" Тогда
		Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхГлавбух", Неопределено);	
	КонецЕсли;	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Расшифровка, "НеАктуальность");
	Элементы.Результат.ИспользуемоеИмяФайла = "Пояснения к балансу. Наличие и движение финансовых вложений, ДЗ, КЗ за " + ПредставлениеПериода(Отчет.Период.ДатаНачала, КонецДня(Отчет.Период.ДатаОкончания));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСписокВариантов()
	
	СписокВариантов = Новый СписокЗначений;
	
	СписокВариантов.Добавить("Основной",	"Основной");
		
	Возврат СписокВариантов; 
	
КонецФункции

&НаСервере
Процедура ТочностьЕдиницыИзмеренияПриИзмененииНаСервере()
	
	Если Отчет.ЕдиницаИзмерения  = Перечисления.ПорядкиОкругленияОтчетности.Окр1 Тогда
		Если Отчет.ТочностьЕдиницыИзмерения > 2 Тогда 
			Отчет.ТочностьЕдиницыИзмерения = 2;
		КонецЕсли;	
	ИначеЕсли Отчет.ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1000 Тогда 
		Если Отчет.ТочностьЕдиницыИзмерения > 3 Тогда 
			Отчет.ТочностьЕдиницыИзмерения = 3;
		КонецЕсли;			
	ИначеЕсли Отчет.ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1000000 Тогда
		Если Отчет.ТочностьЕдиницыИзмерения > 6 Тогда 
			Отчет.ТочностьЕдиницыИзмерения = 6;
		КонецЕсли;					
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ТочностьЕдиницыИзмеренияПриИзменении(Элемент)
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Расшифровка, "НеАктуальность");
	ТочностьЕдиницыИзмеренияПриИзмененииНаСервере()
	
КонецПроцедуры

&НаСервере
Процедура ЕдиницаИзмеренияПриИзмененииНаСервере()
	
	
	
	Если Отчет.ЕдиницаИзмерения  = Перечисления.ПорядкиОкругленияОтчетности.Окр1 Тогда
		Отчет.ТочностьЕдиницыИзмерения = 2;
	ИначеЕсли Отчет.ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1000 Тогда 
		Отчет.ТочностьЕдиницыИзмерения = 0;
	ИначеЕсли Отчет.ЕдиницаИзмерения = Перечисления.ПорядкиОкругленияОтчетности.Окр1000000 Тогда
		Отчет.ТочностьЕдиницыИзмерения = 0;
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ЕдиницаИзмеренияПриИзменении(Элемент)
	
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеАктуальность");
	РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Расшифровка, "НеАктуальность");
	ЕдиницаИзмеренияПриИзмененииНаСервере()
	
КонецПроцедуры

&НаКлиенте 
Процедура АвтоматическоеФормирование() Экспорт

	ЗаполнитьЗначенияСвойств(Отчет, ЭтаФорма.НастройкиОтчета);
	Отчет.Период = ЭтаФорма.НастройкиОтчета.Период;
	
	СтруктураКлюча = Новый Структура;
	СтруктураКлюча.Вставить("Подразделение", ПредопределенноеЗначение("Справочник.Подразделения.ГруппаКомпаний"));
	СтруктураКлюча.Вставить("Язык", ПредопределенноеЗначение("Справочник.Языки.Русский"));
	СтруктураКлюча.Вставить("Объект", Отчет.Организация);
	
	Если ЭтаФорма.НастройкиОтчета.Свойство("КонтактноеЛицо") Тогда 
		СтруктураКлюча.Вставить("КонтактноеЛицо", ЭтаФорма.НастройкиОтчета.Подписант);
		СтруктураДанныхПодписант = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(СтруктураКлюча);
		ЭтаФорма.Подписант = СтруктураДанныхПодписант.КонтактноеЛицо;
		Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", СтруктураДанныхПодписант);
	КонецЕсли;	
	
	Если ЭтаФорма.НастройкиОтчета.Свойство("ПодписантРуководитель") Тогда 
		СтруктураКлюча.Вставить("КонтактноеЛицо", ЭтаФорма.НастройкиОтчета.ПодписантРуководитель);
		СтруктураДанныхРуководитель = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(СтруктураКлюча);
		ЭтаФорма.ПодписантРуководитель = СтруктураДанныхРуководитель.КонтактноеЛицо;
		Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхРуководитель", СтруктураДанныхРуководитель);
	КонецЕсли;	
	
	Если ЭтаФорма.НастройкиОтчета.Свойство("ПодписантГлавбух") Тогда 
		СтруктураКлюча.Вставить("КонтактноеЛицо", ЭтаФорма.НастройкиОтчета.ПодписантГлавбух);
		СтруктураДанныхГлавбух = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(СтруктураКлюча);	
		ЭтаФорма.ПодписантГлавбух = СтруктураДанныхГлавбух.КонтактноеЛицо;
		Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхГлавбух", ЭтаФорма.НастройкиОтчета.ПодписантГлавбух);
	КонецЕсли;	
	
	КомандаСформироватьОтчетНаСервере();
	
	РаботаСОтчетамиКлиент.АвтоматическоеФормированиеОтчета(ЭтаФорма, ЭтаФорма.Результат);
	
КонецПроцедуры

&НаСервере
Процедура ВычислитьСуммуВыделенныхЯчеекТабличногоДокументаВКонтекстеНаСервере()
	
	ПолеСумма = ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(
		Результат, КэшВыделеннойОбласти);
	
КонецПроцедуры
	
&НаСервере
Процедура ВычислитьСуммуВыделенныхЯчеекТабличногоДокументаВКонтекстеНаСервереРасшифровка()
	
	ПолеСумма = ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(
		Расшифровка, КэшВыделеннойОбласти);
	
КонецПроцедуры
	
&НаКлиенте
Процедура Подключаемый_РезультатПриАктивизацииОбластиПодключаемый()
	
	НеобходимоВычислятьНаСервере = Ложь;
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(
		ПолеСумма, Результат, КэшВыделеннойОбласти, НеобходимоВычислятьНаСервере);
	
	Если НеобходимоВычислятьНаСервере Тогда
		ВычислитьСуммуВыделенныхЯчеекТабличногоДокументаВКонтекстеНаСервере();
	КонецЕсли;
	
	ОтключитьОбработчикОжидания("Подключаемый_РезультатПриАктивизацииОбластиПодключаемый");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РасшифровкаПриАктивизацииОбластиПодключаемый()
	
	НеобходимоВычислятьНаСервере = Ложь;
	РаботаСБухгалтерскимиОтчетамиКлиентСервер.ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(
		ПолеСумма, Расшифровка, КэшВыделеннойОбласти, НеобходимоВычислятьНаСервере);
	
	Если НеобходимоВычислятьНаСервере Тогда
		ВычислитьСуммуВыделенныхЯчеекТабличногоДокументаВКонтекстеНаСервереРасшифровка();
	КонецЕсли;
	
	ОтключитьОбработчикОжидания("Подключаемый_РезультатПриАктивизацииОбластиПодключаемый");
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСформироватьОтчет(Команда)
	
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
		КомандаСформироватьОтчетНаСервере();
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(ЭтаФорма.Элементы.Результат);
		РаботаСФормамиКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(ЭтаФорма.Элементы.Расшифровка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура КомандаСформироватьОтчетНаСервере()
	РеквизитФормыВЗначение("Отчет").Сформировать(Результат, Расшифровка);
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЯ ТАБЛИЧНОГО ДОКУМЕНТА

&НаКлиенте
Процедура РезультатПриАктивизацииОбласти(Элемент)
	
	Если ТипЗнч(Результат.ВыделенныеОбласти) = Тип("ВыделенныеОбластиТабличногоДокумента") Тогда
		ИнтервалОжидания = ?(ПолучитьСкоростьКлиентскогоСоединения() = СкоростьКлиентскогоСоединения.Низкая, 1, 0.2);
		ПодключитьОбработчикОжидания("Подключаемый_РезультатПриАктивизацииОбластиПодключаемый", ИнтервалОжидания, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаПриАктивизацииОбласти(Элемент)
	
	Если ТипЗнч(Расшифровка.ВыделенныеОбласти) = Тип("ВыделенныеОбластиТабличногоДокумента") Тогда
		ИнтервалОжидания = ?(ПолучитьСкоростьКлиентскогоСоединения() = СкоростьКлиентскогоСоединения.Низкая, 1, 0.2);
		ПодключитьОбработчикОжидания("Подключаемый_РасшифровкаПриАктивизацииОбластиПодключаемый", ИнтервалОжидания, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВычислитьСуммуВыделенныхЯчеекТабличногоДокумента(Знач Результат, КэшВыделеннойОбласти) Экспорт
	
	Сумма = 0;
	Для Каждого КлючИЗначение Из КэшВыделеннойОбласти Цикл
		СтруктураАдресВыделеннойОбласти = КлючИЗначение.Значение;
		Для ИндексСтрока = СтруктураАдресВыделеннойОбласти.Верх По СтруктураАдресВыделеннойОбласти.Низ Цикл
			Для ИндексКолонка = СтруктураАдресВыделеннойОбласти.Лево По СтруктураАдресВыделеннойОбласти.Право Цикл
				Попытка
					Ячейка = Результат.Область(ИндексСтрока, ИндексКолонка, ИндексСтрока, ИндексКолонка);
					Если Ячейка.Видимость = Истина Тогда
						Если Ячейка.СодержитЗначение И ТипЗнч(Ячейка.Значение) = Тип("Число") Тогда
							Сумма = Сумма + Ячейка.Значение;
						ИначеЕсли ЗначениеЗаполнено(Ячейка.Текст) Тогда
							Сумма = Сумма + Число(СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрЗаменить(Ячейка.Текст, " ", ""), ".", ","), ")", ""), "(", "-"));
						КонецЕсли;
					КонецЕсли;
				Исключение
				КонецПопытки;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	КэшВыделеннойОбласти.Вставить("Сумма", Сумма);
	
	Возврат Сумма;
	
КонецФункции

&НаКлиенте
Процедура ЗадолженностьПоМетодикеФОГФПриИзменении(Элемент)
	Элементы.ПодписантГлавбух.Видимость = Отчет.ЗадолженностьПоМетодикеФОГФ;
	Элементы.ПодписантРуководитель.Видимость = Отчет.ЗадолженностьПоМетодикеФОГФ;
	Элементы.Подписант.Видимость = Не Отчет.ЗадолженностьПоМетодикеФОГФ;
КонецПроцедуры
